# Brewfile - 開発者向け Mac セットアップ
# 適用: brew bundle --file=./Brewfile
# wada811/dotfiles (bin/brew-update) のパッケージ構成を参考に再編。
# 不要な行はコメントアウト / 追記して調整してください。

# ============================================================
# Taps
# ============================================================
tap "manaflow-ai/cmux"             # cmux ターミナル

# ============================================================
# CLI: シェル環境
# ============================================================
brew "zsh"
brew "zsh-completions"
brew "peco"                        # インタラクティブ絞り込み (zsh peco-scripts で使用)
brew "terminal-notifier"           # 通知

# ============================================================
# CLI: Git
# ============================================================
brew "git"
brew "gh"                          # GitHub CLI

# ============================================================
# CLI: 環境・バージョン管理
# ============================================================
brew "direnv"                      # ディレクトリ単位の環境変数
brew "mise"                        # 言語ランタイム統合管理 (Ruby/Node/Python 等)
# 注: Ruby も mise で管理する方針。rbenv や nokogiri ビルド依存
#     (libxml2/libxslt 等) は不要。万一 gem ビルドで詰まったら個別に追加する。

# ============================================================
# CLI: データベース
# ============================================================
brew "sqlite"
# brew "mysql"

# ============================================================
# CLI: ユーティリティ
# ============================================================
brew "jq"
brew "tree"
brew "rename"
brew "ripgrep"
brew "fd"
brew "bat"
brew "fzf"
brew "wget"
brew "coreutils"

# ============================================================
# CLI: 画像・動画
# ============================================================
brew "imagemagick"
brew "ffmpeg"
# cask "imageoptim"                # 画像最適化 GUI (wada811 採用)

# ============================================================
# CLI: 言語ランタイム (mise 管理を推奨。直接入れる場合のみ)
# ============================================================
# brew "node"
# brew "python"
# brew "uv"

# ============================================================
# GUI: エディタ / ターミナル / ブラウザ
# ============================================================
cask "visual-studio-code"
# cask "coteditor"                 # 軽量テキストエディタ (wada811 採用)
cask "cmux"                        # Ghostty ベースのターミナル (iTerm2 の代替)
cask "google-chrome"
# cask "firefox"

# ============================================================
# GUI: コミュニケーション・生産性
# ============================================================
cask "slack"
# cask "zoom"
cask "notion"
cask "raycast"
cask "rectangle"                   # ウィンドウ管理
cask "meetingbar"                  # カレンダーの予定をメニューバーに表示
cask "1password"
cask "1password-cli"               # 1password-cli は cask（formula ではない）

# ============================================================
# GUI: ユーティリティ (wada811 採用ツール)
# ============================================================
# cask "the-unarchiver"            # 解凍ツール
# cask "appcleaner"                # アプリ完全削除
# cask "cyberduck"                 # FTP/S3 クライアント
# cask "dropbox"
cask "google-drive"               # Documents 等のフォルダ同期に使用
cask "google-japanese-ime"         # Google 日本語入力
# cask "calibre"                   # 電子書籍管理

# ============================================================
# モバイルアプリ開発 (wada811 = Android/iOS 開発者構成)
# ============================================================
cask "android-studio"             # 安定版
cask "android-studio-preview@canary" # Canary 版 (Android Studio Preview Canary.app)
# brew "dex2jar"                   # APK 解析
# cask "jd-gui"                    # Java デコンパイラ
# brew "cocoapods"                 # iOS 依存管理
# brew "fastlane"                  # iOS/Android リリース自動化
# Xcode は App Store から導入

# ============================================================
# フォント
# ============================================================
# cask "font-jetbrains-mono"
# cask "font-hack-nerd-font"

# ============================================================
# Mac App Store (mas が必要)
# ============================================================
# brew "mas"
# mas "Xcode", id: 497799835
